Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.error.clearNotificationsCorrelationKeyRequiresPanel
source: --correlation-key requires --panel
ar: يتطلب --correlation-key استخدام --panel
de: --correlation-key erfordert --panel
es: --correlation-key requiere --panel
fr: --correlation-key requiert --panel
ja: --correlation-key には --panel が必要です
ko: --correlation-key에는 --panel이 필요합니다.
zh_hans: --correlation-key 需要配合 --panel 使用
zh_hant: --correlation-key 需要搭配 --panel

# cli.error.markNotificationReadSelector
source: mark-notification-read requires exactly one selector: --id, --workspace, or --all
ar: يتطلب mark-notification-read محددًا واحدًا بالضبط: --id أو --workspace أو --all
de: mark-notification-read erfordert genau einen Selektor: --id, --workspace, oder --all
es: mark-notification-read requiere exactamente un selector: --id, --workspace o --all
fr: mark-notification-read requiert exactement un sélecteur : --id, --workspace ou --all
ja: mark-notification-read には --id、--workspace、--all のいずれか一つだけを指定してください
ko: mark-notification-read에는 --id, --workspace, --all 중 정확히 하나의 선택기가 필요합니다.
zh_hans: mark-notification-read 需要且仅需一个选择器：--id、--workspace 或 --all
zh_hant: mark-notification-read 需要正好一個選擇器：--id、--workspace 或 --all

# cli.error.markNotificationReadSurfaceRequiresWorkspace
source: --surface requires --workspace
ar: يتطلب --surface استخدام --workspace
de: --surface erfordert --workspace
es: --surface requiere --workspace
fr: --surface requiert --workspace
ja: --surface には --workspace が必要です
ko: --surface에는 --workspace가 필요합니다.
zh_hans: --surface 需要 --workspace
zh_hant: --surface 需要搭配 --workspace

# cli.error.openNotificationRequiresId
source: open-notification requires --id
ar: يتطلب open-notification استخدام --id
de: open-notification erfordert --id
es: open-notification requiere --id
fr: open-notification requiert --id
ja: open-notification には --id が必要です
ko: open-notification에는 --id가 필요합니다.
zh_hans: open-notification 需要 --id
zh_hant: open-notification 需要 --id

# cli.error.sshSessionAttachSessionNotFound
source: ssh-session-attach: no persisted SSH PTY session with id '%@'. Run 'cmux ssh-session-list --all-workspaces' to see valid session ids.
ar: ssh-session-attach: لا توجد جلسة SSH PTY محفوظة بالمعرف '%@'. قم بتشغيل 'cmux ssh-session-list --all-workspaces' لعرض معرفات الجلسات الصالحة.
de: ssh-session-attach: Keine persistierte SSH-PTY-Sitzung mit der ID „%@“. Führe 'cmux ssh-session-list --all-workspaces' aus, um gültige Sitzungs-IDs anzuzeigen.
es: ssh-session-attach: no existe ninguna sesión SSH PTY persistida con el id '%@'. Ejecuta 'cmux ssh-session-list --all-workspaces' para ver los id de sesión válidos.
fr: ssh-session-attach : aucune session SSH PTY persistante avec l'id '%@'. Exécutez 'cmux ssh-session-list --all-workspaces' pour voir les identifiants de session valides.
ja: ssh-session-attach: ID '%@' の永続 SSH PTY セッションが見つかりません。有効なセッション ID を確認するには 'cmux ssh-session-list --all-workspaces' を実行してください。
ko: ssh-session-attach: ID가 '%@'인 영구 SSH PTY 세션이 없습니다. 유효한 세션 ID 목록을 보려면 'cmux ssh-session-list --all-workspaces'를 실행하세요.
zh_hans: ssh-session-attach: 没有 id 为 '%@' 的持久化 SSH PTY 会话。运行 'cmux ssh-session-list --all-workspaces' 查看有效的会话 id。
zh_hant: ssh-session-attach：沒有識別碼為 '%@' 的持續性 SSH PTY 工作階段。執行 'cmux ssh-session-list --all-workspaces' 以查看有效的工作階段識別碼。

# cli.error.sshSessionAttachStateUnavailable
source: ssh-session-attach: persisted SSH PTY session state is unavailable. Run 'cmux ssh-session-list --all-workspaces' and retry.
ar: ssh-session-attach: حالة جلسة SSH PTY المحفوظة غير متوفرة. قم بتشغيل 'cmux ssh-session-list --all-workspaces' وأعد المحاولة.
de: ssh-session-attach: Der Zustand der persistenten SSH-PTY-Sitzung ist nicht verfügbar. Führen Sie 'cmux ssh-session-list --all-workspaces' aus und versuchen Sie es erneut.
es: ssh-session-attach: el estado de la sesión SSH PTY persistida no está disponible. Ejecuta 'cmux ssh-session-list --all-workspaces' y vuelve a intentarlo.
fr: ssh-session-attach : l'état de la session PTY SSH persistante est indisponible. Exécutez 'cmux ssh-session-list --all-workspaces' et réessayez.
ja: ssh-session-attach: 永続 SSH PTY セッションの状態を利用できません。'cmux ssh-session-list --all-workspaces' を実行してから再試行してください。
ko: ssh-session-attach: 영구 SSH PTY 세션 상태를 사용할 수 없습니다. 'cmux ssh-session-list --all-workspaces'를 실행한 후 다시 시도하십시오.
zh_hans: ssh-session-attach: 持久化 SSH PTY 会话状态不可用。请运行 'cmux ssh-session-list --all-workspaces' 后重试。
zh_hant: ssh-session-attach：持續性 SSH PTY 工作階段狀態不可用。請執行 'cmux ssh-session-list --all-workspaces' 後重試。

# cli.error.sshSessionAttachWorkspaceAmbiguous
source: ssh-session-attach: session '%1$@' exists in multiple workspaces (%2$@). Pass --workspace <workspace> to choose one.
ar: ssh-session-attach: الجلسة '%1$@' موجودة في مساحات عمل متعددة (%2$@). مرر --workspace <workspace> لاختيار واحدة.
de: ssh-session-attach: Sitzung „%1$@“ existiert in mehreren Arbeitsbereichen (%2$@). Übergib --workspace <workspace>, um einen auszuwählen.
es: ssh-session-attach: la sesión '%1$@' existe en múltiples espacios de trabajo (%2$@). Pasa --workspace <workspace> para elegir uno.
fr: ssh-session-attach : la session '%1$@' existe dans plusieurs espaces de travail (%2$@). Passez --workspace <workspace> pour en choisir un.
ja: ssh-session-attach: セッション '%1$@' は複数のワークスペース (%2$@) に存在します。--workspace <workspace> で指定してください。
ko: ssh-session-attach: 세션 '%1$@'이(가) 여러 작업 공간(%2$@)에 존재합니다. 하나를 선택하려면 --workspace <workspace>를 전달하세요.
zh_hans: ssh-session-attach: 会话 '%1$@' 存在于多个工作区（%2$@）。请传入 --workspace <workspace> 指定其中一个。
zh_hant: ssh-session-attach：工作階段 '%1$@' 存在於多個工作區 (%2$@) 中。請傳遞 --workspace <workspace> 來選擇一個。

# cli.error.sshSessionAttachWorkspaceMismatch
source: ssh-session-attach: session '%1$@' belongs to workspace %2$@, but --workspace requested a different workspace
ar: ssh-session-attach: الجلسة '%1$@' تنتمي إلى مساحة عمل %2$@، ولكن الخيار --workspace طلب مساحة عمل مختلفة
de: ssh-session-attach: Sitzung „%1$@“ gehört zum Arbeitsbereich %2$@, aber --workspace hat einen anderen Arbeitsbereich angefordert
es: ssh-session-attach: la sesión '%1$@' pertenece al espacio de trabajo %2$@, pero --workspace solicitó un espacio de trabajo diferente
fr: ssh-session-attach : la session '%1$@' appartient à l'espace de travail %2$@, mais --workspace a demandé un espace de travail différent
ja: ssh-session-attach: セッション '%1$@' はワークスペース %2$@ に属していますが、--workspace では別のワークスペースが指定されました
ko: ssh-session-attach: 세션 '%1$@'은(는) 작업 공간 %2$@에 속해 있으나, --workspace가 다른 작업 공간을 요청했습니다.
zh_hans: ssh-session-attach: 会话 '%1$@' 属于工作区 %2$@，但 --workspace 请求的是另一个工作区
zh_hant: ssh-session-attach：工作階段 '%1$@' 屬於工作區 %2$@，但 --workspace 請求了不同的工作區

# cli.error.sshSessionAttachWorkspaceRequiresValue
source: ssh-session-attach: --workspace requires a value
ar: ssh-session-attach: يتطلب --workspace قيمة
de: ssh-session-attach: --workspace erfordert einen Wert
es: ssh-session-attach: --workspace requiere un valor
fr: ssh-session-attach : --workspace requiert une valeur
ja: ssh-session-attach: --workspace の値を指定してください
ko: ssh-session-attach: --workspace에는 값이 필요합니다.
zh_hans: ssh-session-attach：--workspace 需要一个值
zh_hant: ssh-session-attach：--workspace 需要指定值

# cli.error.workspaceLoadingInvalidId
source: Invalid --id '%@'. Use letters, digits, '.', '_', or '-' (no spaces).
ar: المعرف --id غير صالح '%@'. استخدم الحروف، أو الأرقام، أو '.'، أو '_'، أو '-' (بدون مسافات).
de: Ungültige --id „%@“. Verwende Buchstaben, Ziffern, „.“, „_“ oder „-“ (keine Leerzeichen).
es: --id '%@' no válido. Usa letras, dígitos, '.', '_' o '-' (sin espacios).
fr: --id '%@' non valide. Utilisez des lettres, des chiffres, '.', '_', ou '-' (sans espaces).
ja: 無効な --id '%@' です。英数字、'.'、'_'、'-' のみ使用できます（空白不可）。
ko: 잘못된 --id '%@'입니다. 영문자, 숫자, '.', '_', '-'만 사용할 수 있습니다(공백 불가).
uk: Неприпустимий --id '%@'. Використовуйте літери, цифри, '.', '_' або '-' (без пробілів).
zh_hans: 无效的 --id '%@'。请使用字母、数字、'.'、'_' 或 '-'（不能有空格）。
zh_hant: 無效的 --id '%@'。請使用字母、數字、'.'、'_' 或 '-' (不能有空格)。

# cli.error.workspaceLoadingInvalidState
source: Invalid state '%@'. Expected on or off. %@
ar: حالة غير صالحة '%@'. المتوقع on أو off. %@
de: Ungültiger Zustand „%@“. Erwartet wurde „on“ oder „off“. %@
es: Estado '%@' no válido. Se esperaba on u off. %@
fr: État '%@' non valide. Valeur attendue : on ou off. %@
ja: 無効な状態 '%@' です。on または off を指定してください。%@
ko: 잘못된 상태 '%@'입니다. on 또는 off를 지정하세요. %@
uk: Неприпустимий стан '%@'. Очікується on або off. %@
zh_hans: 无效的状态 '%@'。应为 on 或 off。%@
zh_hant: 無效的狀態 '%@'。預期為 on 或 off。%@

# cli.error.workspaceLoadingNoWorkspace
source: No workspace resolved. Run inside a cmux workspace or pass --workspace <id>.
ar: لم يتم حل أي مساحة عمل. قم بالتشغيل داخل مساحة عمل cmux أو مرر --workspace <id>.
de: Kein Arbeitsbereich aufgelöst. Führen Sie den Befehl in einem cmux-Arbeitsbereich aus oder übergeben Sie --workspace <id>.
es: No se resolvió ningún espacio de trabajo. Ejecútalo dentro de un espacio de trabajo de cmux o pasa --workspace <id>.
fr: Aucun espace de travail résolu. Exécutez la commande à l’intérieur d’un espace de travail cmux ou passez --workspace <id>.
ja: ワークスペースを特定できませんでした。cmux のワークスペース内で実行するか、--workspace <id> を指定してください。
ko: 워크스페이스를 확인할 수 없습니다. cmux 워크스페이스 안에서 실행하거나 --workspace <id>를 지정하세요.
uk: Не вдалося визначити робочий простір. Запустіть у робочому просторі cmux або передайте --workspace <id>.
zh_hans: 未解析到工作区。请在 cmux 工作区内运行，或传入 --workspace <id>。
zh_hant: 未解析工作區。請在 cmux 工作區內執行，或傳遞 --workspace <id>。

# cli.error.workspaceSubcommandRequired
source: workspace requires a subcommand. Try: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ar: تتطلب workspace أمرًا فرعيًا. جرب: list، create، env، close، rename، select، status، reconnect، disconnect، loading، group
de: workspace erfordert einen Unterbefehl. Versuchen Sie: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
es: workspace requiere un subcomando. Prueba con: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
fr: workspace requiert une sous-commande. Essayez : list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ja: workspace にはサブコマンドが必要です。利用可能: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ko: workspace에는 하위 명령이 필요합니다. 사용 가능: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
uk: workspace потребує підкоманди. Доступні: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
zh_hans: workspace 需要一个子命令。可尝试：list、create、env、close、rename、select、status、reconnect、disconnect、loading、group
zh_hant: workspace 需要子命令。請試試：list, create, env, close, rename, select, status, reconnect, disconnect, loading, group

# cli.error.workspaceSubcommandUnknown
source: Unknown workspace subcommand: %@. Try: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ar: أمر فرعي غير معروف لـ workspace: %@. جرب: list، create، env، close، rename، select، status، reconnect، disconnect، loading، group
de: Unbekannter workspace-Unterbefehl: %@. Versuche: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
es: Subcomando de espacio de trabajo desconocido: %@. Prueba con: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
fr: Sous-commande d'espace de travail inconnue : %@. Essayez : list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ja: 不明な workspace サブコマンド: %@。利用可能: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
ko: 알 수 없는 workspace 하위 명령: %@. 사용 가능: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
uk: Невідома підкоманда workspace: %@. Доступні: list, create, env, close, rename, select, status, reconnect, disconnect, loading, group
zh_hans: 未知的 workspace 子命令：%@。可尝试：list、create、env、close、rename、select、status、reconnect、disconnect、loading、group
zh_hant: 未知的 workspace 子命令：%@。請試試：list, create, env, close, rename, select, status, reconnect, disconnect, loading, group

# cli.events.error.invalidTimeout
source: --timeout must be greater than 0
ar: يجب أن يكون --timeout أكبر من 0
de: --timeout muss größer als 0 sein
es: --timeout debe ser mayor que 0
fr: --timeout doit être supérieur à 0
ja: --timeout は0より大きい値である必要があります
ko: --timeout은 0보다 커야 합니다.
zh_hans: --timeout 必须大于 0
zh_hant: --timeout 必須大於 0

# cli.events.error.timeout
source: Timed out waiting for a matching event
ar: انتهت المهلة أثناء انتظار حدث مطابق
de: Zeitüberschreitung beim Warten auf ein passendes Ereignis
es: Se agotó el tiempo de espera buscando un evento coincidente
fr: Délai d’attente dépassé lors de l’attente d’un événement correspondant
ja: 一致するイベントを待機中にタイムアウトしました
ko: 일치하는 이벤트를 기다리는 동안 시간 초과가 발생했습니다.
zh_hans: 等待匹配事件超时
zh_hant: 等候相符事件逾時

# cli.events.help.snapshot
source: Print the subscription snapshot and exit
ar: طباعة لقطة الاشتراك والخروج
de: Den Abonnement-Snapshot ausgeben und beenden
es: Muestra la instantánea de la suscripción y sale
fr: Affiche l’instantané d'abonnement et quitte
ja: 購読スナップショットを表示して終了
ko: 구독 스냅샷을 출력하고 종료
uk: Вивести знімок підписки та завершити роботу
zh_hans: 打印订阅快照后退出
zh_hant: 列印訂閱快照並結束

# cli.events.help.timeout
source: Exit unsuccessfully if no matching event arrives before the deadline
ar: الخروج غير الناجح في حال عدم وصول أي حدث مطابق قبل الموعد النهائي
de: Fehlgeschlagen beenden, wenn vor Ablauf der Frist kein passendes Ereignis eintrifft
es: Sale de forma incorrecta si no llega ningún evento coincidente antes del tiempo límite
fr: Quitte en échec si aucun événement correspondant n’arrive avant l’échéance
ja: 期限までに一致するイベントが届かない場合はエラーで終了
ko: 제한 시간 전에 일치하는 이벤트가 도착하지 않으면 오류로 종료
uk: Завершити з помилкою, якщо відповідна подія не надійде до кінцевого терміну
zh_hans: 若在截止前没有匹配事件到达，则以失败退出
zh_hant: 如果在截止時間前沒有相符事件到達，則結束並顯示失敗

# cli.forwarding.error.allocateArguments
source: cmux could not start this command. Try again, or reinstall cmux if the problem continues.
ar: تعذر على cmux بدء هذا الأمر. حاول مرة أخرى، أو أعد تثبيت cmux إذا استمرت المشكلة.
de: cmux konnte diesen Befehl nicht starten. Versuchen Sie es erneut oder installieren Sie cmux neu, falls das Problem weiterhin besteht.
es: cmux no pudo iniciar este comando. Vuelve a intentarlo o reinstala cmux si el problema continúa.
fr: cmux n'a pas pu démarrer cette commande. Réessayez, ou réinstallez cmux si le problème persiste.
ja: cmux はこのコマンドを開始できませんでした。もう一度試すか、問題が続く場合は cmux を再インストールしてください。
ko: cmux가 이 명령을 시작할 수 없습니다. 다시 시도하거나 문제가 지속되면 cmux를 다시 설치하십시오.
zh_hans: cmux 无法启动此命令。请重试；如果问题仍然存在，请重新安装 cmux。
zh_hant: cmux 無法啟動此命令。請再試一次，如果問題持續發生，請重新安裝 cmux。

# cli.forwarding.error.execFailed
source: cmux could not start the command-line tool from the app bundle. Reinstall cmux or run the command from a standard cmux CLI installation.
ar: تعذر على cmux بدء أداة واجهة خط الأوامر من حزمة التطبيق (app bundle). أعد تثبيت cmux أو قم بتشغيل الأمر من تثبيت cmux CLI قياسي.
de: cmux konnte das Befehlszeilenwerkzeug nicht aus dem App-Bundle starten. Installieren Sie cmux neu oder führen Sie den Befehl aus einer Standard-cmux-CLI-Installation aus.
es: cmux no pudo iniciar la herramienta de línea de comandos desde el paquete de la aplicación. Reinstala cmux o ejecuta el comando desde una instalación estándar de la CLI de cmux.
fr: cmux n'a pas pu démarrer l'outil en ligne de commande à partir du bundle d'application. Réinstallez cmux ou exécutez la commande à partir d'une installation CLI cmux standard.
ja: cmux はアプリバンドルからコマンドラインツールを開始できませんでした。cmux を再インストールするか、通常の cmux CLI インストールからコマンドを実行してください。
ko: cmux가 앱 번들에서 명령줄 도구를 시작할 수 없습니다. cmux를 다시 설치하거나 표준 cmux CLI 설치 경로에서 명령을 실행하십시오.
zh_hans: cmux 无法从应用包中启动命令行工具。请重新安装 cmux，或从标准的 cmux CLI 安装中运行该命令。
zh_hant: cmux 無法從應用程式套件 (app bundle) 啟動命令列工具。請重新安裝 cmux，或者從標準的 cmux CLI 安裝環境中執行該命令。

# cli.forwarding.error.missingBundledCLI
source: cmux could not run this command from the app bundle. Reinstall cmux or run the command from a standard cmux CLI installation.
ar: تعذر على cmux تشغيل هذا الأمر من حزمة التطبيق (app bundle). أعد تثبيت cmux أو قم بتشغيل الأمر من تثبيت cmux CLI قياسي.
de: cmux konnte diesen Befehl nicht aus dem App-Bundle ausführen. Installieren Sie cmux neu oder führen Sie den Befehl aus einer Standard-cmux-CLI-Installation aus.
es: cmux no pudo ejecutar este comando desde el paquete de la aplicación. Reinstala cmux o ejecuta el comando desde una instalación estándar de la CLI de cmux.
fr: cmux n'a pas pu exécuter cette commande à partir du bundle d'application. Réinstallez cmux ou exécutez la commande à partir d'une installation CLI cmux standard.
ja: cmux はアプリバンドルからこのコマンドを実行できませんでした。cmux を再インストールするか、通常の cmux CLI インストールからコマンドを実行してください。
ko: cmux가 앱 번들에서 이 명령을 실행할 수 없습니다. cmux를 다시 설치하거나 표준 cmux CLI 설치 경로에서 명령을 실행하십시오.
zh_hans: cmux 无法从应用包中运行此命令。请重新安装 cmux，或从标准的 cmux CLI 安装中运行该命令。
zh_hant: cmux 無法從應用程式套件中執行此命令。請重新安裝 cmux，或者從標準的 cmux CLI 安裝環境中執行該命令。

# cli.help.clearNotifications
source: Usage: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] Clear queued notifications, optionally scoped to a workspace and surface. Flags: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
ar: الاستخدام: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] مسح الإشعارات الموجودة في قائمة الانتظار، مع إمكانية تحديد النطاق بمساحة عمل وسطح معينة. الخيارات: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
bs: Upotreba: cmux clear-notifications [options] Obrišite obavijesti, uz opcionalno ograničenje na radni prostor, površinu i prozor.
da: Brug: cmux clear-notifications [options] Ryd meddelelser, eventuelt afgrænset til workspace, surface og vindue.
de: Verwendung: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] In Warteschlange eingereihte Benachrichtigungen löschen, optional beschränkt auf einen Arbeitsbereich und eine Oberfläche. Flags: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
es: Uso: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] Limpia las notificaciones en cola, opcionalmente limitadas a un espacio de trabajo y una superficie. Opciones: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
fr: Utilisation : cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] Efface les notifications en attente, éventuellement limitées à un espace de travail et une surface d’affichage. Options : --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
it: Uso: cmux clear-notifications [options] Cancella le notifiche, con filtro facoltativo per spazio di lavoro, superficie e finestra.
ja: 使い方: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] 通知を消去し、必要に応じてワークスペースとサーフェスで限定します。 Flags: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
ko: 사용법: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] 대기 중인 알림을 지웁니다. 선택적으로 특정 작업 공간 및 화면으로 범위를 제한할 수 있습니다. 플래그: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
nb: Bruk: cmux clear-notifications [options] Tøm varsler, eventuelt begrenset til arbeidsområde, overflate og vindu.
pl: Użycie: cmux clear-notifications [options] Wyczyść powiadomienia, opcjonalnie ograniczając je do obszaru, powierzchni i okna.
pt_br: Uso: cmux clear-notifications [options] Limpe as notificações, opcionalmente limitando por workspace, superfície e janela.
ru: Использование: cmux clear-notifications [options] Очистите уведомления, при необходимости ограничив их рабочим пространством, поверхностью и окном.
th: วิธีใช้: cmux clear-notifications [options] ล้างการแจ้งเตือน โดยเลือกเวิร์กสเปซ พื้นผิว และหน้าต่างได้
tr: Kullanım: cmux clear-notifications [options] Bildirimleri temizleyin; çalışma alanı, yüzey ve pencereye göre sınırlayabilirsiniz.
uk: Використання: cmux clear-notifications [options] Очистіть сповіщення, за потреби обмеживши їх робочим простором, поверхнею та вікном.
zh_hans: 用法: cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] 清除队列中的通知，可选择将作用域限制在工作区和表面。 标志: --workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>
zh_hant: 用法：cmux clear-notifications [--workspace <id|ref|index>] [--surface <id|ref|index>] [--window <id|ref|index>] 清除佇列中的通知，可選擇將範圍限制在特定的工作區 and 介面。 旗標：--workspace <id|ref|index> --surface <id|ref|index> --window <id|ref|index>

# cli.help.dismissNotification
source: Usage: cmux dismiss-notification (--id <uuid> | --all-read) Remove one notification, or remove every already-read notification. Flags: --id <uuid> Notification id to remove --all-read Remove every already-read notification --json Print JSON --id-format <mode> refs, uuids, or both
ar: الاستخدام: cmux dismiss-notification (--id <uuid> | --all-read) إزالة إشعار واحد، أو إزالة كل الإشعارات المقروءة بالفعل. الخيارات: --id <uuid> معرف الإشعار المراد إزالته --all-read إزالة كل الإشعارات المقروءة بالفعل --json طباعة بتنسيق JSON --id-format <mode> refs، أو uuids، أو كلاهما
de: Verwendung: cmux dismiss-notification (--id <uuid> | --all-read) Entfernt eine Benachrichtigung oder entfernt alle bereits gelesenen Benachrichtigungen. Flags: --id <uuid> Zu entfernende Benachrichtigungs-ID --all-read Alle bereits gelesenen Benachrichtigungen entfernen --json JSON ausgeben --id-format <mode> refs, uuids oder beides
es: Uso: cmux dismiss-notification (--id <uuid> | --all-read) Elimina una notificación, o elimina todas las notificaciones ya leídas. Opciones: --id <uuid> Id de notificación a eliminar --all-read Elimina todas las notificaciones ya leídas --json Muestra JSON --id-format <mode> refs, uuids o ambos
fr: Utilisation : cmux dismiss-notification (--id <uuid> | --all-read) Supprime une notification, ou supprime toutes les notifications déjà lues. Options : --id <uuid> ID de la notification à supprimer --all-read Supprime toutes les notifications déjà lues --json Affiche le JSON --id-format <mode> refs, uuids ou both
ja: Usage: cmux dismiss-notification (--id <uuid> | --all-read) 通知を1件削除するか、既読の通知をすべて削除します。 Flags: --id <uuid> 削除する通知 ID --all-read 既読の通知をすべて削除 --json JSON を出力 --id-format <mode> refs、uuids、both のいずれか
ko: 사용법: cmux dismiss-notification (--id <uuid> | --all-read) 알림 하나를 제거하거나 이미 읽은 모든 알림을 제거합니다. 플래그: --id <uuid> 제거할 알림 ID --all-read 이미 읽은 모든 알림 제거 --json JSON 출력 --id-format <mode> refs, uuids 또는 둘 다
zh_hans: 用法：cmux dismiss-notification (--id <uuid> | --all-read) 移除一条通知，或移除所有已读通知。 标志: --id <uuid> 要移除的通知 id --all-read 移除所有已读通知 --json 输出 JSON --id-format <mode> refs、uuids 或 both
zh_hant: 用法：cmux dismiss-notification (--id <uuid> | --all-read) 移除單一通知，或移除所有已讀取的通知。 旗標： --id <uuid> 要移除的通知識別碼 --all-read 移除所有已讀取的通知 --json 列印 JSON --id-format <mode> refs、uuids 或兩者皆是
